# Parallel MDF FFT - iCE40HX8K synthesis
read_verilog "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/bit_reverse.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/block_scaler.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/butterfly_r2.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/complex_mult.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/delay_line.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/fft_axi_top.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/fft_stage_fb.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/fft_stage_nf.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/fft_top.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/overflow_detect.v" "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/synth_rtl/twiddle_rom.v"
hierarchy -check -top fft_top
synth_ice40 -top fft_top -json "C:/Users/ntoum/Desktop/Thesis repo/Parallel MDF FFT/synthesis/fft_top.json" -noflatten
stat
